[{"categories":["releases"],"date":1700058732,"description":"Release notes for v3.0.0rc07 of the Rhize application","fuzzywordcount":600,"lastmod":1700058732,"permalink":"https://docs.rhize.com/releases/3-0-0rc07/","publishdate":"2023-11-15T09:32:12-05:00","relpermalink":"/releases/3-0-0rc07/","section":"releases","summary":"Release notes for version 3.0.0rc07 of the Rhize application.\nRelease date: 15th November, 2023\nBreaking changes [SCHEMA] Change types OperationalLocationClass, OperationalLocationClassVersion, OperationalLocationClassProperty, OperationalLocation, OperationalLocationVersion and OperationalLocationProperty to have: isPartOf (0..1), isMadeUpOf (0..*) [BPMN] Change CommandConsumer and Timers to use new JetStream library and durable consumers. This requires you to drop and re-create streams KV_JobResponses, KV_WorkflowSpecifications, libreBpmn_Command and libreTimerStart. Changes by service Admin UI Features\nAdd ability to create Process Segment Version Add ability to edit linked process segment resource specification property Add ability to link a Hierarchy Scope to a Operational Location Class version Add check for renaming a linked property with an existing property name Add Homepage screen Add optional link from Operational Location Class to a Operational Location Class version Add Physical Asset Properties Add Physical Asset Resource Specifications Change","title":"3.0.0rc07","toc":" Breaking changes Changes by service Admin UI Agent BAAS BPMN Core Schema Upgrade ","type":"releases","wordcount":579},{"categories":null,"date":1696372779,"description":"A collection of pages to introduce you to Rhize","fuzzywordcount":100,"lastmod":1696372779,"permalink":"https://docs.rhize.com/get-started/","publishdate":"0001-01-01T00:00:00Z","relpermalink":"/get-started/","section":"get-started","summary":"","title":"Get started","toc":"","type":"get-started","wordcount":0},{"categories":"concepts","date":1695741946,"description":"","fuzzywordcount":800,"lastmod":1695741946,"permalink":"https://docs.rhize.com/get-started/introduction/","publishdate":"2023-09-26T12:25:46-03:00","relpermalink":"/get-started/introduction/","section":"get-started","summary":"Rhize is a real-time, event-driven manufacturing data hub. It unites data analysis, event monitoring, and process execution in one platform. Its interface and architecture is designed to conform to your processes. We assume nothing about what your manufacturing workflows look like.\nRhize has only one strong opinion: all manufacturing objects and data must be modeled on the ISA-95 standard. This standards-based schema is how Rhize connects every data event across an entire operation.","title":"What is Rhize?","toc":" Use cases Modern IT for manufacturing A tool that fits to your processes ","type":"get-started","wordcount":708},{"categories":["how-to"],"date":1700505363,"description":"How to create manufacturing objects from the Rhize UI.","fuzzywordcount":600,"lastmod":1700505363,"permalink":"https://docs.rhize.com/how-to/model/create-objects-ui/","publishdate":"2023-11-20T15:36:03-03:00","relpermalink":"/how-to/model/create-objects-ui/","section":"how-to","summary":"To make a production object visible to the Rhize data hub, you must define it as a data model. Along with its API, Rhize also has a graphical interface to create and update objects in your role-based equipment hierarchy.\nOften, one object references another: for example, a piece of equipment may belong to an equipment class, have a unit of measure as a property, and be associated with process segment. These associations form nodes and edges in your knowledge graph, so the more information relationships that you accurately create, the better.","title":"Create objects from the UI","toc":" Prerequisites General procedure Example: create oven class and instance ","type":"how-to","wordcount":587},{"categories":["how-to"],"date":-62135596800,"description":"A high-level overview of the Rhize install process.","fuzzywordcount":300,"lastmod":-62135596800,"permalink":"https://docs.rhize.com/deploy/install/overview/","publishdate":"0001-01-01T00:00:00Z","relpermalink":"/deploy/install/overview/","section":"deploy","summary":"This guide walks you through how to Install Rhize and its services in a Kubernetes environment. You can also use these docs to model automation workflows in your CI.\nThis procedure aims to be as generic and vendor-neutral as possible. Some configuration depends on where and how you run your IT infrastructure—what cloud provider you use, preferred auxiliary tools, and so on\u0026mdash;so your team must adapt the process for its particular use cases.","title":"Overview","toc":" Condensed instructions ","type":"deploy","wordcount":210},{"categories":"how-to","date":1695405039,"description":"Configure a data source to publish topics for the Rhize platform.","fuzzywordcount":300,"lastmod":1695405039,"permalink":"https://docs.rhize.com/how-to/publish-subscribe/connect-datasource/","publishdate":"2023-09-22T14:50:39-03:00","relpermalink":"/how-to/publish-subscribe/connect-datasource/","section":"how-to","summary":"For Rhize to listen to and handle manufacturing events, you need to connect a data source .\nPrerequisites To add a data source, you need the following:\nAccess to an MQTT or OPC UA server Credentials for this server, if necessary The URL and connection string for this server (Rhize will point to this) Steps to connect The process has two sides:\nSending topics from your MQTT, OPCUA, or NATS server to Rhize.","title":"Connect data source","toc":" Prerequisites Steps to connect Model the data source on Rhize Next steps ","type":"how-to","wordcount":233},{"categories":["how-to"],"date":1695404993,"description":"How to install Rhize services on your Kubernetes cluster.","fuzzywordcount":400,"lastmod":1695404993,"permalink":"https://docs.rhize.com/deploy/install/setup-kubernetes/","publishdate":"2023-09-22T14:49:53-03:00","relpermalink":"/deploy/install/setup-kubernetes/","section":"deploy","summary":"This guide shows you how to install Rhize services on your Kubernetes cluster. You can also use this procedure as the model for an automation workflow in your CI.\nPrerequisites Before starting, ensure that you have the following technical requirements.\nSoftware requirements:\nkubectl Helm Curl, or some similar program to make HTTP requests from the command line Access requirements:\nAdministrative privileges for a running Kubernetes cluster in your environment. Your organization must set this up.","title":"Set up Kubernetes","toc":" Prerequisites Steps to set up Kubernetes Next steps ","type":"deploy","wordcount":328},{"categories":["releases"],"date":1698797263,"description":"Release notes for v3.0.0rc06 of the Rhize application","fuzzywordcount":300,"lastmod":1698797263,"permalink":"https://docs.rhize.com/releases/3-0-0rc06/","publishdate":"2023-10-31T21:07:43-03:00","relpermalink":"/releases/3-0-0rc06/","section":"releases","summary":"Release notes for version 3.0.0rc06 of the Rhize application.\nRelease date: October 31, 2023\nBreaking changes NATS streams libreBpmn_command and LibreTimerStart must be deleted prior to starting Changes by service Core Features\nAdd mutation for dependency check for DataSource, Equipment, EquipmentClass, OperationalLocation, and OperationalLocationClass Changes\nChange to go-module for schema Change struct literal unkeyed fields to keyed BPMN Breaking Changes\nNATS streams libreBpmn_command and LibreTimerStart must be deleted prior to starting Features","title":"3.0.0rc06","toc":" Breaking changes Changes by service Core BPMN Agent Admin UI Schema Upgrade ","type":"releases","wordcount":256},{"categories":["how-to"],"date":1700657010,"description":"How to query your manufacturing knowledge graph","fuzzywordcount":1500,"lastmod":1700657010,"permalink":"https://docs.rhize.com/how-to/gql/call-the-graphql-api/","publishdate":"2023-11-22T09:43:30-03:00","relpermalink":"/how-to/gql/call-the-graphql-api/","section":"how-to","summary":"In a manufacturing operation, all event data is interrelated. To make these relations explorable, Rhize stores data in a special-purpose graph database designed to represent all levels of the manufacturing process. This database is enforced by our ISA-95 schema, the most comprehensive data representation of ISA-95 in the world.\nRhize exposes this database through a GraphQL API. Unlike REST, GraphQL requires only one endpoint, and you can define exactly the data that you return for each operation.","title":"Call the GraphQL API","toc":" Operation types Call syntax Authentication Request body Request exactly the data you want Make input dynamic with variables Shortcuts for more expressive requests Template requested fields with fragments Filter arrays Cascade ","type":"how-to","wordcount":1479},{"categories":["reference"],"date":1700076561,"description":"A reference of all manufacturing data objects and properties that you can create in the Rhize UI","fuzzywordcount":1500,"lastmod":1700076561,"permalink":"https://docs.rhize.com/how-to/model/master-definitions/","publishdate":"2023-11-15T16:29:21-03:00","relpermalink":"/how-to/model/master-definitions/","section":"how-to","summary":"To make a production object visible to the Rhize data hub, you must define it as a data model.\nThese sections document all the objects that you can add through the UI, and the fields and properties that you can associate with them. All these models are based on the ISA-95 standard, mostly from Part 2, which describes the role-based equipment hierarchy.\nGlobal object fields All objects that you define must have a unique name.","title":"Master definitions and fields","toc":" Global object fields Version states Equipment Equipment class Data Sources Material definition Material Class Person Personnel Class Operational Location Operational Location Class Physical Asset Physical asset class Operations Definition Hierarchy Scope Units of Measure Process segment Work Master ","type":"how-to","wordcount":1438},{"categories":["releases"],"date":1698795154,"description":"Release notes for v3.0.0rc05 of the Rhize application","fuzzywordcount":400,"lastmod":1698795154,"permalink":"https://docs.rhize.com/releases/3-0-0rc05/","publishdate":"2023-10-31T20:32:34-03:00","relpermalink":"/releases/3-0-0rc05/","section":"releases","summary":"Release notes for version 3.0.0rc05 of the Rhize application.\nRelease date: October 24, 2023\nBreaking changes Renamed UI environment variables and changed KEYCLOACK to KEYCLOAK Changes by service Core Features\nAdd deleteSyncEquipmentsFromDBtoNATSStatus mutation Add NATS connection name Add fields to InformationObject Fixes\nFix tracing typo Changes\nChange Core to purge keys that are not in the the database Change core to delete property value from KV when the equipment no longer have active version BPMN Features","title":"3.0.0rc05","toc":" Breaking changes Changes by service Core BPMN Agent Admin UI Schema Upgrade ","type":"releases","wordcount":376},{"categories":null,"date":1697734343,"description":"A collection of pages to administrate Rhize: install, upgrade, back up, and more.","fuzzywordcount":100,"lastmod":1697734343,"permalink":"https://docs.rhize.com/deploy/","publishdate":"0001-01-01T00:00:00Z","relpermalink":"/deploy/","section":"deploy","summary":"A collection of pages to administrate Rhize: install, upgrade, back up, and more.","title":"Deploy","toc":"","type":"deploy","wordcount":13},{"categories":["how-to"],"date":1697637706,"description":"How to back up the Rhize graph database","fuzzywordcount":500,"lastmod":1697637706,"permalink":"https://docs.rhize.com/deploy/backup/graphdb/","publishdate":"2023-10-18T11:01:46-03:00","relpermalink":"/deploy/backup/graphdb/","section":"deploy","summary":"This guide shows you how to back up the Rhize Graph database. You can also use it to model an automation workflow.\nPrerequisites Before you start, ensure you have the following:\nA designated backup location, for example ~/rhize-backups/database. Access to your Rhize Kubernetes Environment Optional: kubectx utilities kubectx to manage multiple clusters kubens to switch between and configure namespaces easily Optional: the k8 Lens IDE, if you prefer to use Kubernetes graphically.","title":"Back up the Graph DB","toc":" Prerequisites Steps Confirm success Next Steps ","type":"deploy","wordcount":479},{"categories":"how-to","date":1695405039,"description":"","fuzzywordcount":200,"lastmod":1695405039,"permalink":"https://docs.rhize.com/how-to/model/","publishdate":"2023-09-22T14:50:39-03:00","relpermalink":"/how-to/model/","section":"how-to","summary":"To connect data, you must define it as a model in the Rhize data hub.\nUse the UI to define it for an individual unit or class POST a batch over the GraphQL API Use BPMN as a filter receive an incoming ERP document and map into the system The trade offs are usually upfront configuration time, number of items to add, and level of automation. Adding an item over the UI requires no programming skill, but you can only add only one unit at a time.","title":"Define production models","toc":"","type":"how-to","wordcount":120},{"categories":null,"date":1695401666,"description":"A guide to install Rhize services on your Kubernetes cluster.","fuzzywordcount":100,"lastmod":1695401666,"permalink":"https://docs.rhize.com/deploy/install/","publishdate":"2023-09-22T13:54:26-03:00","relpermalink":"/deploy/install/","section":"deploy","summary":"This guide shows you how to install Rhize services on your Kubernetes cluster.\nThis procedure aims to be as generic and vendor-neutral as possible. Some configuration depends on where and how you run your IT infrastructure—what cloud provider you use, preferred auxiliary tools, and so on\u0026mdash;so your team must adapt the process for its particular use cases.","title":"Install","toc":"","type":"deploy","wordcount":57},{"categories":"how-to","date":-62135596800,"description":"The Rhize GraphQL implementation uses OpenIDConnect for Authentication and role-based access control. This section describes how to set up Keycloak","fuzzywordcount":1e3,"lastmod":-62135596800,"permalink":"https://docs.rhize.com/deploy/install/keycloak/","publishdate":"0001-01-01T00:00:00Z","relpermalink":"/deploy/install/keycloak/","section":"deploy","summary":"Rhize uses Keycloak as an OpenID provider. In your cluster, the Keycloak server to authenticate users, services, and manage Role-based access controls.\nThis topic describes how to set up Keycloak in your Rhize cluster. For a conceptual overview of the authentication flow, read About OpenID Connect\nPrerequisites First, ensure that you have followed the instructions from Set up Kubernetes. All prerequisites for that step apply here.\nSteps Follow these steps to configure a Keycloak realm and associate Rhize services to Keycloak clients, groups, roles, and policies.","title":"Configure Keycloak","toc":" Prerequisites Steps Log in Create a realm Create clients Scope services Create roles and groups Add Client Policy Add users Next steps ","type":"deploy","wordcount":983},{"categories":"how-to","date":-62135596800,"description":"Instructions to install services in the Rhize Kubernetes cluster.","fuzzywordcount":1100,"lastmod":-62135596800,"permalink":"https://docs.rhize.com/deploy/install/services/","publishdate":"0001-01-01T00:00:00Z","relpermalink":"/deploy/install/services/","section":"deploy","summary":"The final installation step is to install the Rhize services in your Kubernetes cluster.\nPrerequisites This topic assumes you have Set up Kubernetes and Configured Keycloak. All the prerequisites for those topics apply here. Configure load balancing for the following DNS records: Service Domain Admin UI \u0026lt;CUSTOMER\u0026gt;-libre.libremfg.ai Keycloak \u0026lt;CUSTOMER\u0026gt;-auth.libremfg.ai GraphQL \u0026lt;CUSTOMER\u0026gt;-graphql.libremfg.ai NATS \u0026lt;CUSTOMER\u0026gt;-mqtt.libremfg.ai Highbyte \u0026lt;CUSTOMER\u0026gt;-highbyte.libremfg.ai Grafana \u0026lt;CUSTOMER\u0026gt;-grafana.libremfg.ai BPMN \u0026lt;CUSTOMER\u0026gt;-bpmn.libremfg.ai Overrides Each service is installed through a Helm YAML file. For some of these services, you might need to edit this file to add credential information and modify defaults.","title":"Install Rhize services","toc":" Prerequisites Overrides Get client secrets. Install and add roles for the DB Install services NATS Tempo Core BPMN Router Grafana Agent Install UI Troubleshoot ","type":"deploy","wordcount":1013},{"categories":"how-to","date":1695405039,"description":"Set up event-driven messaging for Rhize","fuzzywordcount":100,"lastmod":1695405039,"permalink":"https://docs.rhize.com/how-to/publish-subscribe/","publishdate":"2023-09-22T14:50:39-03:00","relpermalink":"/how-to/publish-subscribe/","section":"how-to","summary":"For Rhize to listen to and handle manufacturing events, you need to connect a data source .","title":"Connect process events","toc":"","type":"how-to","wordcount":17},{"categories":null,"date":1700657010,"description":"Topics about how to use Rhize to query data, build and run workflows, and build frontends.","fuzzywordcount":100,"lastmod":1700657010,"permalink":"https://docs.rhize.com/how-to/","publishdate":"0001-01-01T00:00:00Z","relpermalink":"/how-to/","section":"how-to","summary":"Topics about how to use Rhize to query data, build and run workflows, and build frontends.","title":"User guides","toc":"","type":"how-to","wordcount":16},{"categories":null,"date":1697734343,"description":"How to restore a backup of the Rhize Graph DB.","fuzzywordcount":400,"lastmod":1697734343,"permalink":"https://docs.rhize.com/deploy/restore/graphdb/","publishdate":"2023-10-19T13:52:23-03:00","relpermalink":"/deploy/restore/graphdb/","section":"deploy","summary":"This guide shows you how to restore the Graph database in your Rhize environment.\nPrerequisites Before you start, ensure you have the following:\nThe GraphDB Helm chart kubectl A Database backup Steps Confirm the cluster and namespace are correct.\n## context kubectl config current-context ## namespace kubectl get namespace Change to the libre-baas helm chart overrides, baas.yaml. Set alpha.initContainers.init.enable to true.\nUpgrade or install the Helm chart.\nhelm upgrade --install -f baas.","title":"Restore the GraphDB","toc":" Prerequisites Steps ","type":"deploy","wordcount":380},{"categories":"concepts","date":1696372779,"description":"A high-level overview of how Rhize collects, exchanges, and stores data, starting with data collection and ending with user interaction.","fuzzywordcount":800,"lastmod":1696372779,"permalink":"https://docs.rhize.com/get-started/how-rhize-works/","publishdate":"2023-10-03T19:39:39-03:00","relpermalink":"/get-started/how-rhize-works/","section":"get-started","summary":"This article provides a high-level overview of how Rhize works, starting with data collection and ending with user interaction. To make these concepts more concrete, the final section provides examples of each process.\nThe heart of the Rhize platform is its manufacturing knowledge graph, which stores data from all levels of the operation and exposes this data through a single endpoint. Around the database are services that exchange messages and process events in real-time.","title":"How Rhize works","toc":" Examples in practice Data inputs Message exchange Data storage The interfaces Deployment ","type":"get-started","wordcount":780},{"categories":["how-to"],"date":1694507735,"description":"Guides to back up your data on Rhize","fuzzywordcount":100,"lastmod":1694507735,"permalink":"https://docs.rhize.com/deploy/backup/","publishdate":"2023-09-12T19:35:35+11:00","relpermalink":"/deploy/backup/","section":"deploy","summary":"Backup is critical to ensure reliability and recovery.\nThese guides show you how to back up different services and data on Rhize. They also serve as blueprints for automation.\nYour organization must determine how frequently you backup services, and how long you store them for. The correct practice here is highly contextual, depending on the size of the data, the importance of the data, and the general regulatory and governance demands of your industry.","title":"Back up","toc":"","type":"deploy","wordcount":74},{"categories":["how-to"],"date":1694507735,"description":"Guides to restore your data on Rhize","fuzzywordcount":100,"lastmod":1694507735,"permalink":"https://docs.rhize.com/deploy/restore/","publishdate":"2023-09-12T19:35:35+11:00","relpermalink":"/deploy/restore/","section":"deploy","summary":"These guides show you how to restore data from backup. They also serve as blueprints for automation.\nEven if you don\u0026rsquo;t need to restore data, it\u0026rsquo;s a good practice to test restoration periodically.","title":"Restore","toc":"","type":"deploy","wordcount":33},{"categories":["concepts"],"date":-62135596800,"description":"Examples of how to use the different GraphQL operations in Rhize","fuzzywordcount":800,"lastmod":-62135596800,"permalink":"https://docs.rhize.com/how-to/gql/query-mutate-subscribe/","publishdate":"0001-01-01T00:00:00Z","relpermalink":"/how-to/gql/query-mutate-subscribe/","section":"how-to","summary":"This document provides examples for how to use the Rhize GraphQL API to query, update, and subscribe to objects in the Manufacturing data hub.\nIn GraphQL, an operation is a type of request to the server. Rhize supports three types of operations:\nQueries return data and subsets of data. Mutations change the data on the server side. Subscriptions notify about data changes in real time. Queries Most queries start with these three verbs, each of which indicates the resources to return.","title":"Query, mutate, and subscribe","toc":" Queries get single resource Query multiple resources Aggregate data from multiple resources Mutations Add Update Delete Subscriptions ","type":"how-to","wordcount":735},{"categories":["how-to"],"date":1697734343,"description":"How to restore a Grafana backup on Rhize","fuzzywordcount":300,"lastmod":1697734343,"permalink":"https://docs.rhize.com/deploy/restore/grafana/","publishdate":"2023-10-19T13:52:23-03:00","relpermalink":"/deploy/restore/grafana/","section":"deploy","summary":"This guide shows you how to restore Grafana in your Rhize environment.\nPrerequisites Before you start, ensure you have the following:\nkubectl A Grafana backup Steps Confirm the cluster and namespace are correct:\n## context kubectl config current-context ## namespace kubectl get namespace If a checksum file does not exist for the latest backups, create one:\nsha256sum \u0026lt;LATEST_DATA_FILE\u0026gt;.tar.gz \u0026lt;LATEST_CONF_FILE\u0026gt;.tar.gz \u0026gt; backup.sums Copy the checksum file into the new Grafana Pod within the /home/grafana directory:","title":"Restore Grafana","toc":" Prerequisites Steps ","type":"deploy","wordcount":235},{"categories":["how-to"],"date":1697637716,"description":"How to backup Grafana on your Rhize deployment","fuzzywordcount":400,"lastmod":1697637716,"permalink":"https://docs.rhize.com/deploy/backup/grafana/","publishdate":"2023-10-18T11:01:56-03:00","relpermalink":"/deploy/backup/grafana/","section":"deploy","summary":"This guide shows you the procedure to back up Grafana on your Rhize Kubernetes deployment. For general instructions, refer to the official Back up Grafana documentation.\nPrerequisites Before you start, ensure you have the following:\nA designated backup location, for example ~/rhize-backups/grafana. Access to the Rhize Kubernetes Environment Optional: kubectx utilities kubectx to manage multiple clusters kubens to switch between and configure namespaces easily Optional: the k8 Lens IDE, if you prefer to use Kubernetes graphically Also, before you start, confirm you are in the right context and namespace.","title":"Back up Grafana","toc":" Prerequisites Steps Confirm success Next steps ","type":"deploy","wordcount":374},{"categories":"how-to","date":1695405039,"description":"Create BPMN workflows to handle inputs, react to events, process data, and throw triggers.","fuzzywordcount":700,"lastmod":1695405039,"permalink":"https://docs.rhize.com/how-to/bpmn/create-workflow/","publishdate":"2023-09-22T14:50:39-03:00","relpermalink":"/how-to/bpmn/create-workflow/","section":"how-to","summary":"This topic shows you how to use the BPMN UI to create event-driven workflows. To view the full list of elements and their parameters, refer to BPMN elements.\nPrerequisites To create a workflow, you\u0026rsquo;ll need:\nAn installed environment Topics to publish and subscribe to The ability to call the GraphQL API and understand JSON. General procedures Every workflow is different, but the overall procedure usually works like this:\nCreate a start event:","title":"Create BPMN workflows","toc":" Prerequisites General procedures Examples Build an Alert Write ERP material definition to database Invoke other BPMN workflows ","type":"how-to","wordcount":615},{"categories":"how-to","date":1695405039,"description":"Create BPMN workflows to handle inputs and listen for events, and throw triggers.","fuzzywordcount":100,"lastmod":1695405039,"permalink":"https://docs.rhize.com/how-to/bpmn/","publishdate":"2023-09-22T14:50:39-03:00","relpermalink":"/how-to/bpmn/","section":"how-to","summary":"The heart of a manufacturing process is not data, but the event.\nFor its event handling, Rhize uses a custom BPMN engine:\nThe low-code, graphical notation makes workflow programming accessible to more people in your operation Its event-based workflows can listen for events published to the message broker, and send messages back The service task interface can make GraphQL queries, thus operate directly on the data in your data hub. In the following topics, learn how to use Rhize\u0026rsquo;s BPMN engine.","title":"Handle events","toc":"","type":"how-to","wordcount":81},{"categories":null,"date":1700657010,"description":"Guides to use the GraphQL interface to query information, add records, and build custom UIs.","fuzzywordcount":100,"lastmod":1700657010,"permalink":"https://docs.rhize.com/how-to/gql/","publishdate":"0001-01-01T00:00:00Z","relpermalink":"/how-to/gql/","section":"how-to","summary":"","title":"Use the knowledge graph","toc":"","type":"how-to","wordcount":0},{"categories":null,"date":1698954582,"description":"A collection of pages to look up values for schemas, definitions, and anything else related to using Rhize.","fuzzywordcount":100,"lastmod":1698954582,"permalink":"https://docs.rhize.com/reference/","publishdate":"0001-01-01T00:00:00Z","relpermalink":"/reference/","section":"reference","summary":"A collection of pages to look up values for schemas, definitions, and anything else related to using Rhize.","title":"Reference","toc":"","type":"reference","wordcount":18},{"categories":["how-to"],"date":1697652144,"description":"How to upgrade Rhize","fuzzywordcount":200,"lastmod":1697652144,"permalink":"https://docs.rhize.com/deploy/upgrade/","publishdate":"2023-10-18T15:02:24-03:00","relpermalink":"/deploy/upgrade/","section":"deploy","summary":"This guide shows you how to upgrade Rhize.\nPrerequisites Before you start, ensure you have the following:\nAccess to the Rhize Kubernetes Environment helm Optional: kubectx utilities kubectx to manage multiple clusters kubens to switch between and configure namespaces easily Optional: the k8 Lens IDE, if you prefer to use Kubernetes graphically Be sure that you notify relevant parties of the coming upgrade.\nProcedure First, record the old and new versions, their context, and namespaces.","title":"Upgrade","toc":" Prerequisites Procedure Verify success ","type":"deploy","wordcount":198},{"categories":["reference"],"date":1695737437,"description":"A reference of all BPMN elements used in the Rhize BPMN engine.","fuzzywordcount":1200,"lastmod":1695737437,"permalink":"https://docs.rhize.com/how-to/bpmn/bpmn-elements/","publishdate":"2023-09-26T11:10:37-03:00","relpermalink":"/how-to/bpmn/bpmn-elements/","section":"how-to","summary":"These pages describe the elements to make a Rhize BPMN workflow, and their parameters to set conditions, use variables, and call services.\nRhize BPMN elements are based on the Business Process Model and Notation OMG Standard. While the visual grammar is functionally the same, we extend some elements for specific Rhize features, like service tasks that call the GraphQL API.\nEach BPMN workflow is a process with an ID. Each process is made up events (circles), activities (rectangles), gateways (diamonds), and flows (arrows).","title":"BMPN elements","toc":" Events Message Timer Error Service tasks JSONata transform GraphQL Query GraphQL Mutation Call REST API Read Datasource Write Datasource Call activities Gateways Exclusive gateway Parallel gateway JSONata expression syntax ","type":"how-to","wordcount":1182},{"categories":["concepts"],"date":-62135596800,"description":"If a BPMN node suddenly fails, Rhize has a number of recovery methods to ensure that the workflow finishes executing.","fuzzywordcount":400,"lastmod":-62135596800,"permalink":"https://docs.rhize.com/deploy/restore/bpmn-nodes/","publishdate":"0001-01-01T00:00:00Z","relpermalink":"/deploy/restore/bpmn-nodes/","section":"deploy","summary":"BPMN processes often have longer execution durations and many steps. If a BPMN node suddenly fails (for example through a panic or loss of power), Rhize needs to ensure that the workflow completes.\nTo achieve high availability and resiliency, Rhize services run in Kubernetes nodes, and the NATS message broker typically has data replication. As long as the remaining BPMN nodes are not already at full processing capacity, if a BPMN node fails while executing a process, the Rhize system recovers and finishes the workflow.","title":"BPMN execution recovery","toc":" BPMN failure and recovery modes BPMN node failure NATS node unavailable All BPMN elements age out after ten minutes ","type":"deploy","wordcount":364},{"categories":["reference"],"date":1698954582,"description":"A list of the default ports for the various Rhize services","fuzzywordcount":100,"lastmod":1698954582,"permalink":"https://docs.rhize.com/reference/default-ports/","publishdate":"2023-11-02T16:49:42-03:00","relpermalink":"/reference/default-ports/","section":"reference","summary":"After you install Rhize services, they are accessible, by default, on the following ports:\nService Default Port Admin UI localhost:3030 Grafana localhost:3001 Router localhost:4000 Keycloak localhost:8090 baas-alpha command line localhost:8080 ","title":"Default local ports","toc":"","type":"reference","wordcount":30},{"categories":["reference"],"date":-62135596800,"description":"Authentication types for the Rhize agent","fuzzywordcount":200,"lastmod":-62135596800,"permalink":"https://docs.rhize.com/reference/agent-configuration/","publishdate":"0001-01-01T00:00:00Z","relpermalink":"/reference/agent-configuration/","section":"reference","summary":"The Rhize agent collects data that is emitted in the manufacturing process and makes this data visible in the Rhize system. It works by connecting to equipment or groups of equipment that run over protocols such as OPC UA.\nAs the communication bridge between the Rhize Data Hub and your plant, the agent has multiple functions:\nIt subscribes to tags and republishes the changes in NATS. It creates an interface for the BPMN engine to send reads and writes to a data source and its associated equipment.","title":"Agent configuration","toc":" OPC UA authentication types ","type":"reference","wordcount":156},{"categories":["reference"],"date":1694507735,"description":"A list of terms relevant to Rhize, or that are frequently used in manufacturing contexts.","fuzzywordcount":800,"lastmod":1694507735,"permalink":"https://docs.rhize.com/reference/glossary/","publishdate":"2023-09-12T19:35:35+11:00","relpermalink":"/reference/glossary/","section":"reference","summary":"The manufacturing industry has many specialized terms—and many abbreviations. This glossary is a reference of how Rhize defines terms used in this documentation.\nAgent The Rhize agent bridges your plant processes with the Rhize data hub. It collects data that is emitted during the manufacturing process and publishes it to the NATS message broker. Andon A system that alerts manufacturing teams about problems in processes or quality. Business Process Model and Notation (BPMN) A standardized graphical notation used to represent business processes in an intuitive, visual way Catch event In BPMN, a catch event reacts to a trigger (compared to a throw event, which returns some result).","title":"Glossary","toc":"","type":"reference","wordcount":729},{"categories":["concepts"],"date":-62135596800,"description":"The Rhize GraphQL implementation uses OpenIDConnect for Authentication and role-based access control. This section describes how to set up Keycloak","fuzzywordcount":300,"lastmod":-62135596800,"permalink":"https://docs.rhize.com/deploy/about-openidconnect/","publishdate":"0001-01-01T00:00:00Z","relpermalink":"/deploy/about-openidconnect/","section":"deploy","summary":"Rhize uses OpenIDConnect to connect to a Keycloak server to authenticate users and manage Role-based access controls.\nOpen ID Connect is a security architecture that uses JSON Web Tokens (JWTs) to access secured resources. JWTs are issued by KeyCloak. Users can also be managed in KeyCloak. Or you can manage users in other services such as LDAP, Google, Azure AD, Facebook, etc.\nThe general authentication flow is as follows:\nWhen a user accesses the user interface, the UI redirects to Keycloak.","title":"About OpenID connect","toc":"","type":"deploy","wordcount":235},{"categories":null,"date":1700058732,"description":"Documentation about new features and upgrade instructions.","fuzzywordcount":100,"lastmod":1700058732,"permalink":"https://docs.rhize.com/releases/","publishdate":"0001-01-01T00:00:00Z","relpermalink":"/releases/","section":"releases","summary":"Read about new Rhize features and how to upgrade versions.","title":"Releases","toc":"","type":"releases","wordcount":10},{"categories":null,"date":1700657010,"description":"User guides, deploy docs, references, and deep dives about the Rhize manufacturing data hub.","fuzzywordcount":200,"lastmod":1700657010,"permalink":"https://docs.rhize.com/","publishdate":"0001-01-01T00:00:00Z","relpermalink":"/","section":"","summary":"The Rhize Manufacturing Data Hub Rhize is a real-time, event-driven manufacturing data hub.\nRhize unites all events from your manufacturing processes, relates these events as single graph structure, and provides access to any combination of them through a single API endpoint. The tight integration of all levels of manufacturing data, from real-time sensor data to operations orders, serves a wide variety of business needs, including as:\nA manufacturing knowledge graph, helping humans and algorithms analyze plant processes and discover places to optimize.","title":"","toc":"","type":"page","wordcount":184},{"categories":null,"date":1700657010,"description":"","fuzzywordcount":100,"lastmod":1700657010,"permalink":"https://docs.rhize.com/categories/","publishdate":"0001-01-01T00:00:00Z","relpermalink":"/categories/","section":"categories","summary":"","title":"Categories","toc":"","type":"categories","wordcount":0},{"categories":null,"date":1700657010,"description":"","fuzzywordcount":100,"lastmod":1700657010,"permalink":"https://docs.rhize.com/categories/how-to/","publishdate":"0001-01-01T00:00:00Z","relpermalink":"/categories/how-to/","section":"categories","summary":"","title":"how-to","toc":"","type":"categories","wordcount":0},{"categories":null,"date":1700076561,"description":"","fuzzywordcount":100,"lastmod":1700076561,"permalink":"https://docs.rhize.com/categories/reference/","publishdate":"0001-01-01T00:00:00Z","relpermalink":"/categories/reference/","section":"categories","summary":"","title":"reference","toc":"","type":"categories","wordcount":0},{"categories":null,"date":1700058732,"description":"","fuzzywordcount":100,"lastmod":1700058732,"permalink":"https://docs.rhize.com/categories/releases/","publishdate":"0001-01-01T00:00:00Z","relpermalink":"/categories/releases/","section":"categories","summary":"","title":"releases","toc":"","type":"categories","wordcount":0},{"categories":null,"date":1696372779,"description":"","fuzzywordcount":100,"lastmod":1696372779,"permalink":"https://docs.rhize.com/categories/concepts/","publishdate":"0001-01-01T00:00:00Z","relpermalink":"/categories/concepts/","section":"categories","summary":"","title":"concepts","toc":"","type":"categories","wordcount":0},{"categories":null,"date":-62135596800,"description":"","fuzzywordcount":100,"lastmod":-62135596800,"permalink":"https://docs.rhize.com/tags/","publishdate":"0001-01-01T00:00:00Z","relpermalink":"/tags/","section":"tags","summary":"","title":"Tags","toc":"","type":"tags","wordcount":0},{"categories":null,"date":-62135596800,"description":"Streaming data in and out of RHIZE","fuzzywordcount":700,"lastmod":-62135596800,"permalink":"https://docs.rhize.com/how-to/publish-subscribe/track-changes/","publishdate":"0001-01-01T00:00:00Z","relpermalink":"/how-to/publish-subscribe/track-changes/","section":"how-to","summary":"You can use change data capture (CDC) to track data changes over time, including mutations and drops in your database. Rhize\u0026rsquo;s CDC implementation can use Kafka, Nats or a local file as a sink to store CDC updates streamed by Rhize\u0026rsquo;s Alpha leader nodes.\nWhen CDC is enabled, Rhize streams events for:\nAll set and delete mutations, except those that affect password fields Drop events. Live Loader events are recorded by CDC, but Bulk Loader events aren\u0026rsquo;t.","title":"Track changes (CDC)","toc":" Enable CDC with Kafka sink Enable CDC with file sink Enable CDC with nats jetstream KV store sink CDC command reference CDC data format Mutation event examples Drop event examples Known limitations ","type":"how-to","wordcount":685}]